Model: "sequential_1"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d_4 (Conv2D)           (None, 127, 1205, 64)     320       
                                                                 
 max_pooling2d_4 (MaxPooling  (None, 63, 602, 64)      0         
 2D)                                                             
                                                                 
 dropout_4 (Dropout)         (None, 63, 602, 64)       0         
                                                                 
 conv2d_5 (Conv2D)           (None, 62, 601, 128)      32896     
                                                                 
 max_pooling2d_5 (MaxPooling  (None, 31, 300, 128)     0         
 2D)                                                             
                                                                 
 dropout_5 (Dropout)         (None, 31, 300, 128)      0         
                                                                 
 conv2d_6 (Conv2D)           (None, 30, 299, 256)      131328    
                                                                 
 max_pooling2d_6 (MaxPooling  (None, 7, 74, 256)       0         
 2D)                                                             
                                                                 
 dropout_6 (Dropout)         (None, 7, 74, 256)        0         
                                                                 
 conv2d_7 (Conv2D)           (None, 6, 73, 512)        524800    
                                                                 
 max_pooling2d_7 (MaxPooling  (None, 1, 12, 512)       0         
 2D)                                                             
                                                                 
 dropout_7 (Dropout)         (None, 1, 12, 512)        0         
                                                                 
 flatten_1 (Flatten)         (None, 6144)              0         
                                                                 
 dense_4 (Dense)             (None, 2048)              12584960  
                                                                 
 dense_5 (Dense)             (None, 1024)              2098176   
                                                                 
 dense_6 (Dense)             (None, 256)               262400    
                                                                 
 dense_7 (Dense)             (None, 10)                2570      
                                                                 
=================================================================
Total params: 15,637,450
Trainable params: 15,637,450
Non-trainable params: 0
_________________________________________________________________
