Model: "sequential_6"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d_23 (Conv2D)          (None, 127, 1205, 64)     320       
                                                                 
 max_pooling2d_23 (MaxPoolin  (None, 63, 602, 64)      0         
 g2D)                                                            
                                                                 
 dropout_21 (Dropout)        (None, 63, 602, 64)       0         
                                                                 
 conv2d_24 (Conv2D)          (None, 62, 601, 128)      32896     
                                                                 
 max_pooling2d_24 (MaxPoolin  (None, 31, 300, 128)     0         
 g2D)                                                            
                                                                 
 dropout_22 (Dropout)        (None, 31, 300, 128)      0         
                                                                 
 conv2d_25 (Conv2D)          (None, 30, 299, 256)      131328    
                                                                 
 max_pooling2d_25 (MaxPoolin  (None, 7, 74, 256)       0         
 g2D)                                                            
                                                                 
 dropout_23 (Dropout)        (None, 7, 74, 256)        0         
                                                                 
 conv2d_26 (Conv2D)          (None, 6, 73, 512)        524800    
                                                                 
 max_pooling2d_26 (MaxPoolin  (None, 1, 12, 512)       0         
 g2D)                                                            
                                                                 
 dropout_24 (Dropout)        (None, 1, 12, 512)        0         
                                                                 
 flatten_4 (Flatten)         (None, 6144)              0         
                                                                 
 dense_16 (Dense)            (None, 2048)              12584960  
                                                                 
 dense_17 (Dense)            (None, 1024)              2098176   
                                                                 
 dense_18 (Dense)            (None, 256)               262400    
                                                                 
 dense_19 (Dense)            (None, 10)                2570      
                                                                 
=================================================================
Total params: 15,637,450
Trainable params: 15,637,450
Non-trainable params: 0
_________________________________________________________________
